#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`failure`

<details><summary>Show Plan</summary>

```

tofu
Acquiring state lock. This may take a few moments...
cloudflare_r2_bucket.rpi_k8s: Refreshing state... [id=rpi-k8s-backup]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # cloudflare_dns_record.subdomain["actual"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "actual.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["bazar"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "bazar.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["compartilhado"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "compartilhado.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["jellyfin"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "jellyfin.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["jellyseerr"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "jellyseerr.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["kuma"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "kuma.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["minio"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "minio.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["minio-data"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "minio-data.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["n8n"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "n8n.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["npm"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "npm.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["portainer"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "portainer.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["radar"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "radar.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["readar"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "readar.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["sabnzbd"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "sabnzbd.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["sonar"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "sonar.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["tandoor"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tandoor.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["transmission"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "transmission.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["wyl"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "wyl.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @guilhermewolf, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Plan`*